antoine-voiry/ESP32-DIV/src/main.cpp
#include <Arduino.h>
#include <TFT_eSPI.h>
#include <Wire.h>
#ifndef ESP32_DIV_V1_BOARD
#include <PCF8574.h>
#endif

#include "Touchscreen.h"
#include "wificonfig.h"
#include "bleconfig.h"
#include "subconfig.h"
#include "utils.h"
#include "shared.h"
#include "webui.h"
#include "eeprom_layout.h"
#include "icon.h"
#include "hal9000_bg.h"

#include "hal/hal_globals.h"
#include "hal/TftDisplay.h"
#include "hal/Esp32ADC.h"
#include "hal/Esp32Eeprom.h"
#include "hal/SdStorage.h"
#include "hal/CC1101Radio.h"
#include "hal/Nrf24Radio.h"
#include "proximity_wand.h"

TFT_eSPI tft = TFT_eSPI();

#define pcf_ADDR 0x20
PCF8574 pcf(pcf_ADDR);

#define BTN_UP     6
#define BTN_DOWN   3
#define BTN_LEFT   4
#define BTN_RIGHT  5
#define BTN_SELECT 7

bool feature_exit_requested = false;

const int NUM_MENU_ITEMS = 8;
const char *menu_items[NUM_MENU_ITEMS] = {
    "WiFi",
    "Bluetooth",
    "2.4GHz",
    "SubGHz",
    "IR Remote",
    "Tools",
    "Setting",
    "About"};

const unsigned char *bitmap_icons[NUM_MENU_ITEMS] = {
    bitmap_icon_hal9000_wifi,
    bitmap_icon_hal9000_bluetooth,
    bitmap_icon_hal9000_jammer,
    bitmap_icon_hal9000_subghz,
    bitmap_icon_hal9000_ir,
    bitmap_icon_hal9000_tools,
    bitmap_icon_hal9000_setting,
    bitmap_icon_hal9000_about};

int current_menu_index = 0;
bool is_main_menu = false;


const int NUM_SUBMENU_ITEMS = 7; 
const char *submenu_items[NUM_SUBMENU_ITEMS] = {
    "Packet Monitor",
    "Beacon Spammer",
    "WiFi Deauther",
    "Deauth Detector",
    "WiFi Scanner",
    "Captive Portal",
    "Back to Main Menu"}; 


const int bluetooth_NUM_SUBMENU_ITEMS = 6; 
const char *bluetooth_submenu_items[bluetooth_NUM_SUBMENU_ITEMS] = {
    "BLE Jammer",
    "BLE Spoofer",
    "Sour Apple",
    "Sniffer",
    "BLE Scanner",
    "Back to Main Menu"};


const int nrf_NUM_SUBMENU_ITEMS = 5;
const char *nrf_submenu_items[nrf_NUM_SUBMENU_ITEMS] = {
    "Scanner",
    "Spectrum Analyzer",
    "WLAN Jammer",
    "Proto Kill",
    "Back to Main Menu"};    


const int subghz_NUM_SUBMENU_ITEMS = 5; 
const char *subghz_submenu_items[subghz_NUM_SUBMENU_ITEMS] = {
    "Replay Attack",
    "Brute Force",
    "SubGHz Jammer",
    "Saved Profile",
    "Back to Main Menu"};  


const int tools_NUM_SUBMENU_ITEMS = 4;
const char *tools_submenu_items[tools_NUM_SUBMENU_ITEMS] = {
    "Serial Monitor",
    "Update Firmware",
    "Proximity Wand",
    "Back to Main Menu"};


const int settings_NUM_SUBMENU_ITEMS = 6;
const char *settings_submenu_items[settings_NUM_SUBMENU_ITEMS] = {
    "Brightness",
    "Screen Timeout",
    "Device Info",
    "Display Theme",
    "Phone Remote",
    "Back to Main Menu"};


const int ir_NUM_SUBMENU_ITEMS = 3; 
const char *ir_submenu_items[ir_NUM_SUBMENU_ITEMS] = {
    "Record [Coming soon]",
    "Saved Profile [Coming soon]",
    "Back to Main Menu"};


const int about_NUM_SUBMENU_ITEMS = 1; 
const char *about_submenu_items[about_NUM_SUBMENU_ITEMS] = {
    "Back to Main Menu"};
    
int current_submenu_index = 0;
bool in_sub_menu = false;

const char **active_submenu_items = nullptr;
int active_submenu_size = 0;


const unsigned char *wifi_submenu_icons[NUM_SUBMENU_ITEMS] = {
    bitmap_icon_wifi,         // Packet Monitor
    bitmap_icon_antenna,      // Beacon Spammer
    bitmap_icon_wifi_jammer,  // WiFi Deauther
    bitmap_icon_eye2,         // Deauth Detector
    bitmap_icon_jammer,       // WiFi Scanner
    bitmap_icon_bash,         // Captive Portal
    bitmap_icon_go_back       
};

const unsigned char *bluetooth_submenu_icons[bluetooth_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_ble_jammer,  // BLE Jammer
    bitmap_icon_spoofer,     // BLE Spoofer
    bitmap_icon_apple,       // Sour Apple
    bitmap_icon_analyzer,    // Analyzer
    bitmap_icon_graph,       // BLE Scanner
    bitmap_icon_go_back      
};

const unsigned char *nrf_submenu_icons[nrf_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_scanner,      // Scanner
    bitmap_icon_analyzer,     // Spectrum Analyzer
    bitmap_icon_wifi_jammer,  // WLAN Jammer
    bitmap_icon_kill,         // Proto Kill
    bitmap_icon_go_back
};

const unsigned char *subghz_submenu_icons[subghz_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_antenna,   // Replay Attack
    bitmap_icon_hal9000_eye,  // Brute Force
    bitmap_icon_no_signal, // SubGHz Jammer
    bitmap_icon_list,      // Saved Profile
    bitmap_icon_go_back
};

const unsigned char *tools_submenu_icons[tools_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_bash,     // Serial Monitor
    bitmap_icon_follow,   // Update Firmware
    bitmap_icon_scanner,  // Proximity Wand
    bitmap_icon_go_back
};

const unsigned char *settings_submenu_icons[settings_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_led,      // Brightness
    bitmap_icon_eye2,     // Screen Timeout
    bitmap_icon_stat,     // Device Info
    bitmap_icon_eye2,     // Display Theme  (reuses eye icon)
    bitmap_icon_follow,   // Phone Remote
    bitmap_icon_go_back   // Back
};

const unsigned char *ir_submenu_icons[ir_NUM_SUBMENU_ITEMS] = {
    bitmap_icon_question,     
    bitmap_icon_question,  
    bitmap_icon_go_back        
};

const unsigned char *about_submenu_icons[about_NUM_SUBMENU_ITEMS] = { 
    bitmap_icon_go_back        
};


const unsigned char **active_submenu_icons = nullptr;

void updateActiveSubmenu() {
    switch (current_menu_index) {
        case 0: // WiFi
            active_submenu_items = submenu_items;
            active_submenu_size = NUM_SUBMENU_ITEMS;
            active_submenu_icons = wifi_submenu_icons;
            break;
        case 1: // Bluetooth
            active_submenu_items = bluetooth_submenu_items;
            active_submenu_size = bluetooth_NUM_SUBMENU_ITEMS;
            active_submenu_icons = bluetooth_submenu_icons;
            break;
        case 2: // 2.4GHz (NRF)
            active_submenu_items = nrf_submenu_items;
            active_submenu_size = nrf_NUM_SUBMENU_ITEMS;
            active_submenu_icons = nrf_submenu_icons;
            break;
        case 3: // SubGHz
            active_submenu_items = subghz_submenu_items;
            active_submenu_size = subghz_NUM_SUBMENU_ITEMS;
            active_submenu_icons = subghz_submenu_icons;
            break;
        case 4: // IR
            active_submenu_items = ir_submenu_items;
            active_submenu_size = ir_NUM_SUBMENU_ITEMS;
            active_submenu_icons = ir_submenu_icons;
            break;
        case 5: // Tools
            active_submenu_items = tools_submenu_items;
            active_submenu_size = tools_NUM_SUBMENU_ITEMS;
            active_submenu_icons = tools_submenu_icons;
            break;
        case 6: // Settings
            active_submenu_items = settings_submenu_items;
            active_submenu_size = settings_NUM_SUBMENU_ITEMS;
            active_submenu_icons = settings_submenu_icons;
            break;
        case 7: // About
            active_submenu_items = about_submenu_items;
            active_submenu_size = about_NUM_SUBMENU_ITEMS;
            active_submenu_icons = about_submenu_icons;
            break;    
            
        default:
            active_submenu_items = nullptr;
            active_submenu_size = 0;
            active_submenu_icons = nullptr;
            break;
    }
}

