antoine-voiry/ESP32-DIV/src/main.cpp
bool isButtonPressed(int buttonPin) {
  return !pcf.digitalRead(buttonPin);
}

float currentBatteryVoltage = 0.0;  // Initialize to 0, updated in loop() by readBatteryVoltage()
unsigned long last_interaction_time = 0;


/*
#define BACKLIGHT_PIN 4

const unsigned long BACKLIGHT_TIMEOUT = 100000;

void manageBacklight() {
  if (millis() - last_interaction_time > BACKLIGHT_TIMEOUT) {
    digitalWrite(BACKLIGHT_PIN, LOW);
  } else {
    digitalWrite(BACKLIGHT_PIN, HIGH);
  }
}
*/


int last_submenu_index = -1; 
bool submenu_initialized = false; 
int last_menu_index = -1; 
bool menu_initialized = false; 


void displaySubmenu() {
    menu_initialized = false;
    last_menu_index = -1;

    tft.setTextFont(4);
    tft.setTextSize(1);

    if (!submenu_initialized) {
        tft.fillScreen(BG_BASE);

        for (int i = 0; i < active_submenu_size; i++) {
            int yPos = 30 + i * 40;
            tft.fillRect(0, yPos, tft.width(), 40, BG_BASE);
            tft.fillRect(0, yPos, 4, 40, ACCENT_BORDER);
            tft.drawBitmap(10, yPos + 12, active_submenu_icons[i], 16, 16, TEXT_PRIMARY);
            tft.setTextColor(TEXT_PRIMARY, BG_BASE);
            tft.setCursor(32, yPos + 7);
            tft.print(active_submenu_items[i]);
        }

        submenu_initialized = true;
        last_submenu_index = -1;
    }

    if (last_submenu_index != current_submenu_index) {
        // Deselect previous row
        if (last_submenu_index >= 0) {
            int prev_yPos = 30 + last_submenu_index * 40;
            tft.fillRect(0, prev_yPos, tft.width(), 40, BG_BASE);
            tft.fillRect(0, prev_yPos, 4, 40, ACCENT_BORDER);
            tft.drawBitmap(10, prev_yPos + 12, active_submenu_icons[last_submenu_index], 16, 16, TEXT_PRIMARY);
            tft.setTextFont(4);
            tft.setTextColor(TEXT_PRIMARY, BG_BASE);
            tft.setCursor(32, prev_yPos + 7);
            tft.print(active_submenu_items[last_submenu_index]);
        }

        // Highlight selected row
        int new_yPos = 30 + current_submenu_index * 40;
        tft.fillRoundRect(2, new_yPos, tft.width() - 4, 40, 4, ACCENT_SELECT);
        tft.drawBitmap(10, new_yPos + 12, active_submenu_icons[current_submenu_index], 16, 16, BG_BASE);
        tft.setTextFont(4);
        tft.setTextColor(BG_BASE, ACCENT_SELECT);
        tft.setCursor(32, new_yPos + 7);
        tft.print(active_submenu_items[current_submenu_index]);

        last_submenu_index = current_submenu_index;
    }

    drawStatusBar(currentBatteryVoltage, true);
}

const int COLUMN_WIDTH = 120;  
const int X_OFFSET_LEFT = 10;  
const int X_OFFSET_RIGHT = X_OFFSET_LEFT + COLUMN_WIDTH;  
const int Y_START = 34;
const int Y_SPACING = 75;   

void themeToggleLoop();  // defined in SETTINGS section below

void displayMenu() {

const uint16_t icon_colors[NUM_MENU_ITEMS] = {
  0xFFFF, // WiFi
  0xFFFF, // Bluetooth
  0xFFFF, // 2.4GHz
  0xFFFF, // SubGHz
  0xFFFF, // IR Remote
  0xFFFF, // Tools
  0x8410, // Setting
  0xFFFF  // About
};
  
    submenu_initialized = false;
    last_submenu_index = -1;
    tft.setTextFont(2);

    if (!menu_initialized) {
        // Black background with HAL9000 eye panel
        tft.fillScreen(BG_BASE);

        // Center the HAL9000 panel on screen
        int hal9000X = (240 - HAL9000_BG_WIDTH) / 2;
        int hal9000Y = (320 - HAL9000_BG_HEIGHT) / 2;

        // Draw HAL9000 eye in red
        tft.drawBitmap(hal9000X, hal9000Y, hal9000_bg_bitmap, HAL9000_BG_WIDTH, HAL9000_BG_HEIGHT, 0xF800);

        for (int i = 0; i < NUM_MENU_ITEMS; i++) {
            int column = i / 4;
            int row = i % 4;
            int x_position = (column == 0) ? X_OFFSET_LEFT : X_OFFSET_RIGHT;
            int y_position = Y_START + row * Y_SPACING;

            // Clear/transparent button - just border, no fill
            tft.drawRoundRect(x_position, y_position, 100, 60, 5, HALEHOUND_CYAN);
            tft.drawBitmap(x_position + 42, y_position + 10, bitmap_icons[i], 16, 16, HALEHOUND_CYAN);

            tft.setTextColor(HALEHOUND_CYAN);  // Transparent background
            int textWidth = 6 * strlen(menu_items[i]);
            int textX = x_position + (100 - textWidth) / 2;
            int textY = y_position + 30;
            tft.setCursor(textX, textY);
            tft.print(menu_items[i]);
        }
        menu_initialized = true;
        last_menu_index = -1;
    }

    if (last_menu_index != current_menu_index) {
        for (int i = 0; i < NUM_MENU_ITEMS; i++) {
            int column = i / 4;
            int row = i % 4;
            int x_position = (column == 0) ? X_OFFSET_LEFT : X_OFFSET_RIGHT;
            int y_position = Y_START + row * Y_SPACING;

            if (i == last_menu_index) {
                // Deselected - redraw border in cyan (erase magenta border)
                tft.drawRoundRect(x_position, y_position, 100, 60, 5, HALEHOUND_CYAN);
                tft.drawBitmap(x_position + 42, y_position + 10, bitmap_icons[last_menu_index], 16, 16, HALEHOUND_CYAN);
                tft.setTextColor(HALEHOUND_CYAN);
                int textWidth = 6 * strlen(menu_items[last_menu_index]);
                int textX = x_position + (100 - textWidth) / 2;
                int textY = y_position + 30;
                tft.setCursor(textX, textY);
                tft.print(menu_items[last_menu_index]);
            }
        }

        int column = current_menu_index / 4;
        int row = current_menu_index % 4;
        int x_position = (column == 0) ? X_OFFSET_LEFT : X_OFFSET_RIGHT;
        int y_position = Y_START + row * Y_SPACING;

        // Selected button - magenta border and text
        tft.drawRoundRect(x_position, y_position, 100, 60, 5, HALEHOUND_MAGENTA);
        tft.drawBitmap(x_position + 42, y_position + 10, bitmap_icons[current_menu_index], 16, 16, HALEHOUND_MAGENTA);
        tft.setTextColor(HALEHOUND_MAGENTA);
        int textWidth = 6 * strlen(menu_items[current_menu_index]);
        int textX = x_position + (100 - textWidth) / 2;
        int textY = y_position + 30;
        tft.setCursor(textX, textY);
        tft.print(menu_items[current_menu_index]);

        last_menu_index = current_menu_index;
    }
    drawStatusBar(currentBatteryVoltage, true);
}


void handleWiFiSubmenuButtons() {
    if (isButtonPressed(BTN_UP)) {
        current_submenu_index = (current_submenu_index - 1 + active_submenu_size) % active_submenu_size;
        if (current_submenu_index < 0) {
            current_submenu_index = NUM_SUBMENU_ITEMS - 1;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

    if (isButtonPressed(BTN_DOWN)) {
        current_submenu_index = (current_submenu_index + 1) % active_submenu_size;
        if (current_submenu_index >= NUM_SUBMENU_ITEMS) {
            current_submenu_index = 0;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

