antoine-voiry/ESP32-DIV/src/main.cpp
            if (x >= button_x1 && x <= button_x2 && y >= button_y1 && y <= button_y2) {
                current_submenu_index = i;
                last_interaction_time = millis();
                displaySubmenu();
                delay(200);

                if (current_submenu_index == 5) {
                    in_sub_menu = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displayMenu();
                    return; 
                    is_main_menu = false;           
                } else if (current_submenu_index == 0) {
                    current_submenu_index = 0;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    BleJammer::blejamSetup();  
                    while (current_submenu_index == 0 && !feature_exit_requested) {  
                        current_submenu_index = 0;
                        in_sub_menu = true;
                        BleJammer::blejamLoop();        
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                } else if (current_submenu_index == 1) {
                    current_submenu_index = 1;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    BleSpoofer::spooferSetup();
                    while (current_submenu_index == 1 && !feature_exit_requested) {  
                        current_submenu_index = 1;
                        in_sub_menu = true;
                        BleSpoofer::spooferLoop();        
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                } else if (current_submenu_index == 2) {
                    current_submenu_index = 2;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    SourApple::sourappleSetup(); 
                    while (current_submenu_index == 2 && !feature_exit_requested) {  
                        current_submenu_index = 2;
                        in_sub_menu = true;
                        SourApple::sourappleLoop();        
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                } else if (current_submenu_index == 3) {
                    current_submenu_index = 3;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    BleSniffer::blesnifferSetup(); 
                    while (current_submenu_index == 3 && !feature_exit_requested) {  
                        current_submenu_index = 3;
                        in_sub_menu = true;
                        BleSniffer::blesnifferLoop();
                        if (isButtonPressed(BTN_SELECT)) {
                            BleSniffer::blesnifferCleanup();  // Cleanup BT/BLE resources
                            in_sub_menu = true;
                            is_main_menu = false;
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false;
                            displaySubmenu();
                            delay(200);
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }
                            break;
                        }
                    }
                    if (feature_exit_requested) {
                        BleSniffer::blesnifferCleanup();  // Cleanup BT/BLE resources
                        in_sub_menu = true;
                        is_main_menu = false;
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false;
                        displaySubmenu();
                        delay(200);
                    }
                } else if (current_submenu_index == 4) {
                    current_submenu_index = 4;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    BleScan::bleScanSetup(); 
                    while (current_submenu_index == 4 && !feature_exit_requested) {  
                        current_submenu_index = 4;
                        in_sub_menu = true;
                        BleScan::bleScanLoop();        
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                }
                break;
            }
        }
    }
}


