antoine-voiry/ESP32-DIV/src/main.cpp
void displayThemeScreen() {
    tft.fillScreen(BG_BASE);
    tft.setTextFont(4);
    tft.setTextColor(TEXT_PRIMARY, BG_BASE);
    tft.setCursor(30, 40);
    tft.print("DISPLAY THEME");

    tft.setTextFont(2);
    tft.setTextColor(TEXT_SECONDARY, BG_BASE);
    tft.setCursor(30, 100);
    tft.print("Current:");

    tft.setTextColor(ACCENT_SELECT, BG_BASE);
    tft.setCursor(30, 125);
    tft.print(currentThemeID == THEME_DARK ? "Graphite (Dark)" : "Paper (Light)");

    tft.setTextColor(TEXT_SECONDARY, BG_BASE);
    tft.setCursor(30, 200);
    tft.print("LEFT/RIGHT: Switch");
    tft.setCursor(30, 220);
    tft.print("SELECT: Save & Exit");

    drawStatusBar(currentBatteryVoltage, true);
}

void themeToggleLoop() {
    displayThemeScreen();

    while (!feature_exit_requested) {
        if (isButtonPressed(BTN_LEFT) || isButtonPressed(BTN_RIGHT)) {
            ThemeID next = (currentThemeID == THEME_DARK) ? THEME_LIGHT : THEME_DARK;
            applyTheme(next);
            displayThemeScreen();
            delay(200);
        }
        if (isButtonPressed(BTN_SELECT)) {
            feature_exit_requested = true;
            delay(200);
            break;
        }
        delay(50);
    }
}

int brightness_level = 255;  // Default full brightness
int screen_timeout_seconds = 60;  // Default 60 seconds

void displayBrightnessControl() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextColor(ORANGE, TFT_BLACK);
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setCursor(60, 20);
    tft.print("BRIGHTNESS");

    // Draw brightness bar
    tft.drawRect(30, 80, 180, 30, SHREDDY_TEAL);
    int bar_width = ::map(brightness_level, 0, 255, 0, 176);
    tft.fillRect(32, 82, bar_width, 26, ORANGE);

    // Show percentage
    tft.setCursor(90, 130);
    tft.setTextColor(SHREDDY_TEAL, TFT_BLACK);
    int percent = ::map(brightness_level, 0, 255, 0, 100);
    tft.printf("%d%%", percent);

    tft.setCursor(30, 200);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.print("LEFT/RIGHT: Adjust");
    tft.setCursor(30, 220);
    tft.print("SELECT: Save & Exit");

    drawStatusBar(currentBatteryVoltage, true);
}

void brightnessControlLoop() {
    displayBrightnessControl();

    while (!feature_exit_requested) {
        if (isButtonPressed(BTN_LEFT)) {
            brightness_level = max(10, brightness_level - 25);
            analogWrite(4, brightness_level);  // TFT_BL is pin 4
            displayBrightnessControl();
            delay(150);
        }
        if (isButtonPressed(BTN_RIGHT)) {
            brightness_level = min(255, brightness_level + 25);
            analogWrite(4, brightness_level);
            displayBrightnessControl();
            delay(150);
        }
        if (isButtonPressed(BTN_SELECT)) {
            feature_exit_requested = true;
            delay(200);
            break;
        }
        delay(50);
    }
}

void displayScreenTimeout() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextColor(ORANGE, TFT_BLACK);
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setCursor(40, 20);
    tft.print("SCREEN TIMEOUT");

    tft.setCursor(80, 100);
    tft.setTextColor(SHREDDY_TEAL, TFT_BLACK);
    tft.setTextSize(2);
    if (screen_timeout_seconds == 0) {
        tft.print("OFF");
    } else {
        tft.printf("%ds", screen_timeout_seconds);
    }
    tft.setTextSize(1);

    tft.setCursor(30, 200);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.print("LEFT/RIGHT: Adjust");
    tft.setCursor(30, 220);
    tft.print("SELECT: Save & Exit");

    drawStatusBar(currentBatteryVoltage, true);
}

void screenTimeoutLoop() {
    displayScreenTimeout();
    int timeout_options[] = {0, 15, 30, 60, 120, 300};
    int num_options = 6;
    int current_option = 3;  // Default to 60s

    // Find current option index
    for (int i = 0; i < num_options; i++) {
        if (timeout_options[i] == screen_timeout_seconds) {
            current_option = i;
            break;
        }
    }

    while (!feature_exit_requested) {
        if (isButtonPressed(BTN_LEFT)) {
            current_option = max(0, current_option - 1);
            screen_timeout_seconds = timeout_options[current_option];
            displayScreenTimeout();
            delay(200);
        }
        if (isButtonPressed(BTN_RIGHT)) {
            current_option = min(num_options - 1, current_option + 1);
            screen_timeout_seconds = timeout_options[current_option];
            displayScreenTimeout();
            delay(200);
        }
        if (isButtonPressed(BTN_SELECT)) {
            feature_exit_requested = true;
            delay(200);
            break;
        }
        delay(50);
    }
}

void displayDeviceInfo() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextColor(ORANGE, TFT_BLACK);
    tft.setTextFont(2);
    tft.setTextSize(1);
    tft.setCursor(60, 10);
    tft.print("DEVICE INFO");

    tft.setTextColor(SHREDDY_TEAL, TFT_BLACK);
    int y = 50;

    tft.setCursor(10, y); tft.print("Device: ESP32-DIV");
    y += 25;
    tft.setCursor(10, y); tft.print("Version: v0.1.0 - HAL9000");
    y += 25;
    tft.setCursor(10, y); tft.print("By: AVo");
    y += 25;
    tft.setCursor(10, y); tft.print("Original: CiferTech");
    y += 25;
    tft.setCursor(10, y); tft.printf("Free Heap: %d", ESP.getFreeHeap());
    y += 25;
    tft.setCursor(10, y); tft.printf("CPU Freq: %dMHz", ESP.getCpuFreqMHz());
    y += 25;
    tft.setCursor(10, y); tft.printf("Flash: %dMB", ESP.getFlashChipSize() / 1024 / 1024);
    y += 25;

    // Battery voltage
    float voltage = readBatteryVoltage();
    tft.setCursor(10, y); tft.printf("Battery: %.2fV", voltage);

    tft.setCursor(50, 280);
    tft.setTextColor(TFT_DARKGREY, TFT_BLACK);
    tft.print("SELECT: Back");

    drawStatusBar(currentBatteryVoltage, true);

    while (!feature_exit_requested) {
        if (isButtonPressed(BTN_SELECT)) {
            feature_exit_requested = true;
            delay(200);
            break;
        }
        delay(50);
    }
}

void webUIPhoneRemoteScreen() {
    tft.fillScreen(TFT_BLACK);
    tft.setTextSize(1);
    tft.setTextColor(HALEHOUND_HOTPINK, TFT_BLACK);
    tft.setCursor(40, 10);
    tft.print("PHONE REMOTE");

    auto redraw = [&]() {
        tft.fillRect(0, 35, 240, 240, TFT_BLACK);
        tft.setTextColor(SHREDDY_TEAL, TFT_BLACK);
        int y = 50;

        // Mode
        Preferences prefs; prefs.begin("webui", true);
        uint8_t mode = prefs.getUChar("mode", 0);
        String apSSID = prefs.getString("ap_ssid", "DIV-Remote");
        prefs.end();
        tft.setCursor(10, y); tft.print("Mode: "); tft.print(mode == 0 ? "AP" : "STA");
        y += 25;
        tft.setCursor(10, y); tft.print("SSID: "); tft.print(apSSID);
        y += 25;

        if (WebUIService::isActive()) {
            String ip = (WiFi.getMode() == WIFI_AP) ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
            tft.setTextColor(HALEHOUND_GREEN, TFT_BLACK);
            tft.setCursor(10, y); tft.print("IP: "); tft.print(ip);
        } else {
            tft.setTextColor(GRAY, TFT_BLACK);
            tft.setCursor(10, y); tft.print("Server: stopped");
        }
        y += 30;

        // Action buttons
        tft.setTextColor(WHITE, TFT_BLACK);
        tft.setCursor(10, y); tft.print("[UP]   Start Server");   y += 30;
        tft.setCursor(10, y); tft.print("[DOWN] Stop Server");    y += 30;
        tft.setCursor(10, y); tft.print("[LEFT] Toggle AP/STA");  y += 30;
        tft.setCursor(10, y); tft.print("[SEL]  Back");
    };

    redraw();
    drawStatusBar(currentBatteryVoltage, true);

    feature_exit_requested = false;
    while (!feature_exit_requested) {
        if (isButtonPressed(BTN_UP)) {
            if (!WebUIService::isActive()) WebUIService::setup();
            redraw();
            delay(300);
        }
        if (isButtonPressed(BTN_DOWN)) {
            if (WebUIService::isActive()) WebUIService::teardown();
            redraw();
            delay(300);
        }
        if (isButtonPressed(BTN_LEFT)) {
            Preferences prefs; prefs.begin("webui", false);
            uint8_t cur = prefs.getUChar("mode", 0);
            prefs.putUChar("mode", cur == 0 ? 1 : 0);
            prefs.end();
            redraw();
            delay(300);
        }
        if (isButtonPressed(BTN_SELECT)) {
            feature_exit_requested = true;
            delay(200);
            break;
        }
        delay(50);
    }
}

