antoine-voiry/ESP32-DIV/src/main.cpp
void handleSettingsSubmenuButtons() {
    if (isButtonPressed(BTN_UP)) {
        current_submenu_index = (current_submenu_index - 1 + active_submenu_size) % active_submenu_size;
        if (current_submenu_index < 0) {
            current_submenu_index = settings_NUM_SUBMENU_ITEMS - 1;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

    if (isButtonPressed(BTN_DOWN)) {
        current_submenu_index = (current_submenu_index + 1) % active_submenu_size;
        if (current_submenu_index >= settings_NUM_SUBMENU_ITEMS) {
            current_submenu_index = 0;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

    if (isButtonPressed(BTN_SELECT)) {
        last_interaction_time = millis();
        delay(200);

        // Back to Main Menu
        if (current_submenu_index == 5) {
            in_sub_menu = false;
            feature_active = false;
            feature_exit_requested = false;
            displayMenu();
            return;
        }

        // Brightness
        if (current_submenu_index == 0) {
            feature_active = true;
            feature_exit_requested = false;
            brightnessControlLoop();
            in_sub_menu = true;
            is_main_menu = false;
            submenu_initialized = false;
            feature_active = false;
            feature_exit_requested = false;
            displaySubmenu();
            delay(200);
        }

        // Screen Timeout
        if (current_submenu_index == 1) {
            feature_active = true;
            feature_exit_requested = false;
            screenTimeoutLoop();
            in_sub_menu = true;
            is_main_menu = false;
            submenu_initialized = false;
            feature_active = false;
            feature_exit_requested = false;
            displaySubmenu();
            delay(200);
        }

        // Device Info
        if (current_submenu_index == 2) {
            feature_active = true;
            feature_exit_requested = false;
            displayDeviceInfo();
            in_sub_menu = true;
            is_main_menu = false;
            submenu_initialized = false;
            feature_active = false;
            feature_exit_requested = false;
            displaySubmenu();
            delay(200);
        }

        // Display Theme
        if (current_submenu_index == 3) {
            feature_active = true;
            feature_exit_requested = false;
            themeToggleLoop();
            in_sub_menu = true;
            is_main_menu = false;
            submenu_initialized = false;
            feature_active = false;
            feature_exit_requested = false;
            displaySubmenu();
            delay(200);
        }

        // Phone Remote
        if (current_submenu_index == 4) {
            feature_active = true;
            feature_exit_requested = false;
            webUIPhoneRemoteScreen();
            in_sub_menu = true;
            is_main_menu = false;
            submenu_initialized = false;
            feature_active = false;
            feature_exit_requested = false;
            displaySubmenu();
            delay(200);
        }
    }

    // Touch handler for Settings menu
    if (ts.touched() && !feature_active) {
        TS_Point p = ts.getPoint();
        delay(10);

        int x, y;
        x = ::map(p.x, TS_MINX, TS_MAXX, 0, 239);
        y = ::map(p.y, TS_MAXY, TS_MINY, 0, 319);

        for (int i = 0; i < active_submenu_size; i++) {
            int yPos = 30 + i * 40;

            int button_x1 = 0;
            int button_y1 = yPos;
            int button_x2 = tft.width();
            int button_y2 = yPos + 40;

            if (x >= button_x1 && x <= button_x2 && y >= button_y1 && y <= button_y2) {
                current_submenu_index = i;
                last_interaction_time = millis();
                displaySubmenu();
                delay(200);

                if (current_submenu_index == 5) {
                    // Touch: Back to Main Menu
                    in_sub_menu = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displayMenu();
                    return;
                } else if (current_submenu_index == 0) {
                    // Touch: Brightness
                    feature_active = true;
                    feature_exit_requested = false;
                    brightnessControlLoop();
                    in_sub_menu = true;
                    is_main_menu = false;
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displaySubmenu();
                    delay(200);
                } else if (current_submenu_index == 1) {
                    // Touch: Screen Timeout
                    feature_active = true;
                    feature_exit_requested = false;
                    screenTimeoutLoop();
                    in_sub_menu = true;
                    is_main_menu = false;
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displaySubmenu();
                    delay(200);
                } else if (current_submenu_index == 2) {
                    // Touch: Device Info
                    feature_active = true;
                    feature_exit_requested = false;
                    displayDeviceInfo();
                    in_sub_menu = true;
                    is_main_menu = false;
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displaySubmenu();
                    delay(200);
                } else if (current_submenu_index == 3) {
                    // Touch: Display Theme
                    feature_active = true;
                    feature_exit_requested = false;
                    themeToggleLoop();
                    in_sub_menu = true;
                    is_main_menu = false;
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displaySubmenu();
                    delay(200);
                } else if (current_submenu_index == 4) {
                    // Touch: Phone Remote
                    feature_active = true;
                    feature_exit_requested = false;
                    webUIPhoneRemoteScreen();
                    in_sub_menu = true;
                    is_main_menu = false;
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displaySubmenu();
                    delay(200);
                }
                break;
            }
        }
    }
}
// ==================== END SETTINGS ====================


void handleToolsSubmenuButtons() {
    if (isButtonPressed(BTN_UP)) {
        current_submenu_index = (current_submenu_index - 1 + active_submenu_size) % active_submenu_size;
        if (current_submenu_index < 0) {
            current_submenu_index = NUM_SUBMENU_ITEMS - 1;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

    if (isButtonPressed(BTN_DOWN)) {
        current_submenu_index = (current_submenu_index + 1) % active_submenu_size;
        if (current_submenu_index >= NUM_SUBMENU_ITEMS) {
            current_submenu_index = 0;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

