antoine-voiry/ESP32-DIV/src/main.cpp
    if (isButtonPressed(BTN_SELECT)) {
        last_interaction_time = millis();
        delay(200);

        if (current_submenu_index == 2) {
            in_sub_menu = false;
            feature_active = false;
            feature_exit_requested = false;
            displayMenu();
            return;
        }

        if (current_submenu_index == 0) {
            current_submenu_index = 0;
            in_sub_menu = true;
            feature_active = true;
            feature_exit_requested = false;
            //replayat::ReplayAttackSetup();
            while (current_submenu_index == 0 && !feature_exit_requested) {  
                current_submenu_index = 0;
                in_sub_menu = true;
                //replayat::ReplayAttackLoop();       
                if (isButtonPressed(BTN_SELECT)) {
                    in_sub_menu = true;
                    is_main_menu = false; 
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false; 
                    displaySubmenu(); 
                    delay(200);            
                    while (isButtonPressed(BTN_SELECT)) {
                        delay(10); yield();
                    }           
                    break;  
                }
            }
            if (feature_exit_requested) {
                in_sub_menu = true;
                is_main_menu = false; 
                submenu_initialized = false;
                feature_active = false;
                feature_exit_requested = false; 
                displaySubmenu(); 
                delay(200);
            }
        }

        if (current_submenu_index == 1) {
            current_submenu_index = 1;
            in_sub_menu = true;
            feature_active = true;
            feature_exit_requested = false; 
            //subjammer::subjammerSetup();
            while (current_submenu_index == 1 && !feature_exit_requested) {  
                current_submenu_index = 1;
                in_sub_menu = true;
                //subjammer::subjammerLoop();       
                if (isButtonPressed(BTN_SELECT)) {
                    in_sub_menu = true;
                    is_main_menu = false; 
                    submenu_initialized = false;
                    feature_active = false;
                    feature_exit_requested = false; 
                    displaySubmenu(); 
                    delay(200);            
                    while (isButtonPressed(BTN_SELECT)) {
                        delay(10); yield();
                    }           
                    break;  
                }
            }
            if (feature_exit_requested) {
                in_sub_menu = true;
                is_main_menu = false; 
                submenu_initialized = false;
                feature_active = false;
                feature_exit_requested = false; 
                displaySubmenu(); 
                delay(200);
            }
        }     
    }

    if (ts.touched() && !feature_active) {
        TS_Point p = ts.getPoint();
        delay(10);

        int x, y;
        x = ::map(p.x, TS_MINX, TS_MAXX, 0, 239);
        y = ::map(p.y, TS_MAXY, TS_MINY, 0, 319);

        for (int i = 0; i < active_submenu_size; i++) {
            int yPos = 30 + i * 30;
            if (i == active_submenu_size - 1) yPos += 10;

            int button_x1 = 10;
            int button_y1 = yPos;
            int button_x2 = 110;
            int button_y2 = yPos + (i == active_submenu_size - 1 ? 40 : 30);

            if (x >= button_x1 && x <= button_x2 && y >= button_y1 && y <= button_y2) {
                current_submenu_index = i;
                last_interaction_time = millis();
                displaySubmenu();
                delay(200);

                if (current_submenu_index == 2) {
                    in_sub_menu = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displayMenu();
                    return;

                } else if (current_submenu_index == 0) {
                    current_submenu_index = 0;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false;
                    //replayat::ReplayAttackSetup();
                    while (current_submenu_index == 0 && !feature_exit_requested) {  
                        current_submenu_index = 0;
                        in_sub_menu = true;
                        //replayat::ReplayAttackLoop();       
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                } else if (current_submenu_index == 1) {
                    current_submenu_index = 1;
                    in_sub_menu = true;
                    feature_active = true;
                    feature_exit_requested = false; 
                    //SavedProfile::saveSetup();
                    while (current_submenu_index == 1 && !feature_exit_requested) {  
                        current_submenu_index = 1;
                        in_sub_menu = true;
                        //SavedProfile::saveLoop();       
                        if (isButtonPressed(BTN_SELECT)) {
                            in_sub_menu = true;
                            is_main_menu = false; 
                            submenu_initialized = false;
                            feature_active = false;
                            feature_exit_requested = false; 
                            displaySubmenu(); 
                            delay(200);            
                            while (isButtonPressed(BTN_SELECT)) {
                                delay(10); yield();
                    }           
                            break;  
                        }
                    }                  
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }
                } 
                break;
            }
        }
    }
}


void handleAboutPage() {

  tft.setTextColor(ORANGE, TFT_BLACK);
  tft.setTextSize(1);
  tft.setTextFont(2);
  
  const char* title = "[About This Project]";
  tft.setCursor(10, 90);
  tft.println(title);
  
  int lineHeight = 30;
  int text_x = 10;
  int text_y = 130;
  tft.setCursor(text_x, text_y);
  tft.println("- ESP32-DIV v0.1.0");
  text_y += lineHeight;
  tft.setCursor(text_x, text_y);
  tft.println("- HAL9000 Edition");
  text_y += lineHeight;
  tft.setCursor(text_x, text_y);
  tft.println("- By: AVo");
  text_y += lineHeight;
  tft.setCursor(text_x, text_y);
  tft.println("- Inspired: HaleHound");
  text_y += lineHeight;
  tft.setCursor(text_x, text_y);
  tft.println("- Original: CiferTech");
  text_y += lineHeight;


    if (isButtonPressed(BTN_UP)) {
        current_submenu_index = (current_submenu_index - 1 + active_submenu_size) % active_submenu_size;
        if (current_submenu_index < 0) {
            current_submenu_index = NUM_SUBMENU_ITEMS - 1;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

    if (isButtonPressed(BTN_DOWN)) {
        current_submenu_index = (current_submenu_index + 1) % active_submenu_size;
        if (current_submenu_index >= NUM_SUBMENU_ITEMS) {
            current_submenu_index = 0;
        }
        last_interaction_time = millis();
        displaySubmenu();
        delay(200);
    }

