antoine-voiry/ESP32-DIV/src/main.cpp
    if (isButtonPressed(BTN_SELECT)) {
        last_interaction_time = millis();
        delay(200);

        if (current_submenu_index == 0) {
            in_sub_menu = false;
            feature_active = false;
            feature_exit_requested = false;
            displayMenu();
            return;
        }
    }

    if (ts.touched() && !feature_active) {
        TS_Point p = ts.getPoint();
        delay(10);

        int x, y;
        x = ::map(p.x, TS_MINX, TS_MAXX, 0, 239);
        y = ::map(p.y, TS_MAXY, TS_MINY, 0, 319);

        for (int i = 0; i < active_submenu_size; i++) {
            int yPos = 30 + i * 30;
            if (i == active_submenu_size - 1) yPos += 10;

            int button_x1 = 10;
            int button_y1 = yPos;
            int button_x2 = 110;
            int button_y2 = yPos + (i == active_submenu_size - 1 ? 40 : 30);

            if (x >= button_x1 && x <= button_x2 && y >= button_y1 && y <= button_y2) {
                current_submenu_index = i;
                last_interaction_time = millis();
                displaySubmenu();
                delay(200);

                if (current_submenu_index == 0) {
                    in_sub_menu = false;
                    feature_active = false;
                    feature_exit_requested = false;
                    displayMenu();
                    return;
                }
                    if (feature_exit_requested) {
                        in_sub_menu = true;
                        is_main_menu = false; 
                        submenu_initialized = false;
                        feature_active = false;
                        feature_exit_requested = false; 
                        displaySubmenu(); 
                        delay(200);
                    }             
            }
        }
    }
}


void handleButtons() {
    if (in_sub_menu) {
        switch (current_menu_index) {
            case 0: handleWiFiSubmenuButtons(); break;
            case 1: handleBluetoothSubmenuButtons(); break;
            case 2: handleNRFSubmenuButtons(); break;
            case 3: handleSubGHzSubmenuButtons(); break;
            case 4: handleIRSubmenuButtons(); break;
            case 5: handleToolsSubmenuButtons(); break;
            case 6: handleSettingsSubmenuButtons(); break;
            case 7: handleAboutPage(); break;
            default: break;
        }
    } else {
      
        if (isButtonPressed(BTN_UP) && !is_main_menu) {
            Serial.println("BTN:UP");
            current_menu_index--;
            if (current_menu_index < 0) {
                current_menu_index = NUM_MENU_ITEMS - 1; 
            }
            last_interaction_time = millis();
            displayMenu();
            delay(200);
        }

        if (isButtonPressed(BTN_DOWN) && !is_main_menu) {
            current_menu_index++;
            if (current_menu_index >= NUM_MENU_ITEMS) {
                current_menu_index = 0; 
            }
            last_interaction_time = millis();
            displayMenu();
            delay(200);
        }

        if (isButtonPressed(BTN_LEFT) && !is_main_menu) {
            int row = current_menu_index % 4; 
            if (current_menu_index >= 4) { 
                current_menu_index = row; 
            } else if (current_menu_index == 0) { 
                current_menu_index = 3; 
            } else { 
                current_menu_index = row - 1;
            }
            last_interaction_time = millis();
            displayMenu();
            delay(200);
        }

        if (isButtonPressed(BTN_RIGHT) && !is_main_menu) {
            int row = current_menu_index % 4; 
            if (current_menu_index < 4) { 
                current_menu_index = row + 4; 
            } else if (current_menu_index == 7) { 
                current_menu_index = 0; 
            } else { 
                current_menu_index = row + 5;
            }
            last_interaction_time = millis();
            displayMenu();
            delay(200);
        }

        if (isButtonPressed(BTN_SELECT)) {
            last_interaction_time = millis();
            updateActiveSubmenu();
            delay(200);

            if (active_submenu_items && active_submenu_size > 0) {
                current_submenu_index = 0;
                in_sub_menu = true;
                submenu_initialized = false;
                displaySubmenu();
                if (current_menu_index == 3 && !gSubGhz->isPresent()) {
                    drawCC1101AbsentBanner();
                }
            }

            if (is_main_menu) {
                is_main_menu = false;
                displayMenu();
            } else {
                is_main_menu = true;
            }
        }

        static unsigned long lastTouchTime = 0;
        const unsigned long touchFeedbackDelay = 100; 

        if (ts.touched() && !feature_active && (millis() - lastTouchTime >= touchFeedbackDelay)) {
            TS_Point p = ts.getPoint();
            delay(10);

            int x, y;
            x = ::map(p.x, TS_MINX, TS_MAXX, 0, 239);
            y = ::map(p.y, TS_MAXY, TS_MINY, 0, 319);

            for (int i = 0; i < NUM_MENU_ITEMS; i++) {
                int column = i / 4; 
                int row = i % 4; 
                int x_position = (column == 0) ? X_OFFSET_LEFT : X_OFFSET_RIGHT;
                int y_position = Y_START + row * Y_SPACING;

                int button_x1 = x_position;
                int button_y1 = y_position;
                int button_x2 = x_position + 100;
                int button_y2 = y_position + 60;

                if (x >= button_x1 && x <= button_x2 && y >= button_y1 && y <= button_y2) {
                    current_menu_index = i; 
                    last_interaction_time = millis();
                    displayMenu(); 

                    unsigned long startTime = millis();
                    while (ts.touched() && (millis() - startTime < touchFeedbackDelay)) {
                        delay(10); 
                    }

                    if (ts.touched()) {
                        updateActiveSubmenu(); 

