antoine-voiry/ESP32-DIV/src/main.cpp
                        if (active_submenu_items && active_submenu_size > 0) {
                            current_submenu_index = 0;
                            in_sub_menu = true;
                            submenu_initialized = false;
                            displaySubmenu();
                        } else {
                            
                            if (is_main_menu) {
                                is_main_menu = false;
                                displayMenu();
                            } else {
                                is_main_menu = true;
                            }
                        }
                    }
                    delay(200);
                    break; 
                }
            }
        }
    }
}


namespace BleJammer { extern RF24 radio1; extern RF24 radio2; extern RF24 radio3; }

static TftDisplay  halDisplay(tft);
static Esp32ADC    halADC;
static Esp32Eeprom halEeprom;
static SdStorage   halStorage;
static CC1101Radio halSubGhz;
static Nrf24Radio  halNrf1(BleJammer::radio1);
static Nrf24Radio  halNrf2(BleJammer::radio2);
static Nrf24Radio  halNrf3(BleJammer::radio3);

void setup() {
    gDisplay = &halDisplay;
    gADC     = &halADC;
    gEeprom  = &halEeprom;
    gStorage = &halStorage;
    gSubGhz  = &halSubGhz;
    gNrf1    = &halNrf1;
    gNrf2    = &halNrf2;
    gNrf3    = &halNrf3;

  Serial.begin(115200);
  gSubGhz->init();
  if (!gSubGhz->isPresent()) {
      Serial.println("[CC1101] not detected — SubGHz disabled");
  }

  EEPROM.begin(EEPROM_TOTAL_SIZE);
  loadThemeFromEEPROM();   // must run before any tft color usage

  tft.init();
  tft.setRotation(0);
  tft.fillScreen(TFT_BLACK);

  setupTouchscreen();

  loading(100, ORANGE, 0, 0, 2, true);
  
  tft.fillScreen(TFT_BLACK);

  displayLogo(HALEHOUND_MAGENTA, 3500);  // 3.5 seconds
  
  //pinMode(36, INPUT);
  //pinMode(BACKLIGHT_PIN, OUTPUT);
  //digitalWrite(BACKLIGHT_PIN, HIGH);
  
  pcf.begin();
  Serial.println("ESP32-DIV:READY");
  pcf.pinMode(BTN_UP, INPUT_PULLUP);
  pcf.pinMode(BTN_DOWN, INPUT_PULLUP);
  pcf.pinMode(BTN_LEFT, INPUT_PULLUP);
  pcf.pinMode(BTN_RIGHT, INPUT_PULLUP);
  pcf.pinMode(BTN_SELECT, INPUT_PULLUP);

  for (int pin = 0; pin < 8; pin++) {
    Serial.print("Button ");
    Serial.print(pin);
    Serial.print(": ");
    Serial.println(pcf.digitalRead(pin) ? "Released" : "Pressed");
  }

  displayMenu();
  currentBatteryVoltage = readBatteryVoltage();  // Update now that ADC is initialized
  drawStatusBar(currentBatteryVoltage, false);
  last_interaction_time = millis();
}

void loop() {
  handleButtons();
  //manageBacklight();
  updateStatusBar();
  WebUIService::loop();
}
